/**
 * Created by Andrey on 01.07.2017.
 * Часть 1.
 *  1. Создать программу, которая будет считать количество и пробелом в тексте.
 *  2. Необходимо создать два Thread. Первый будет считать количество слов. Второй количество пробелом в тексте.
 *  3. Вывести результат на экран.
 *  4. Продемонстрировать, что программа выполняется параллельно. Это будет видно по выводу.
 *
 * Часть 2.
 *  1. Необходимо, что бы вначале запуска программы из первой части на экране выводилась информация о программа.
 *      А после вычисления данных, выводилась запись о завершении программы.
 *      Важно, эта информация всегда должна выводиться в начале и в конце вычисления.
 *  2. Предусмотреть возможность останавливать вычисления, если время вычисления превышает 1 секунде.
 *      Для этого нужно реализовать проверку поведения isInterrunt()
 *  3. Реализовать механизм программнной остановки потока.
 */
package ru.apetrov;