/**
 *  Часть 2.
 *  1.  От хозяина предприятие пришло новое условие требование.
 *      На складе Warehouse не хватает место для хранения и поэтому нужно добавить новый склад. Ваше решение?
 *  2.  Еще одно новое условие. Появились продукты, которые можно переработать после исхода срока годности.
 *      Нужно расширить программу. Что бы продукты в флагом canReproduct отправлялись на переработку.
 *  3.  Еще одно требование. Овощи пришедшие на обработку и попадающие на клад.
 *      Должны храниться в специальном складе с низкой температурой. Ваши решения.
 */
package ru.apetrov.UpdateFoodStorage;