/**
 * //TODO add comments.
 * Создать программу, которая будет проверять, является ли слово из пяти букв,
 * введённое пользователем, палиндромом (примеры: «комок», «ротор»).
 * Если введено слово не из 5 букв, то сообщать об ошибке.
 * Программа должна нормально обрабатывать слово, даже если в нём использованы символы разного регистра.
 * Например, слова «Комок» или «РОТОР» следует также считать палиндромами.
 * @author Andrey Petrov
 * @version $Id$
 * @since 0.1
 */
package ru.apetrov.Palindrom;